performance-tests/load-test.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
    - duration: 60
      arrivalRate: 20
      name: "Peak load"
    - duration: 60
      arrivalRate: 5
      name: "Cool down"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Health check"
    weight: 30
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Root endpoint"
    weight: 20
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200

  - name: "Image generation"
    weight: 50
    flow:
      - post:
          url: "/generate"
          json:
            prompt: "A beautiful wedding venue with elegant decorations"
          expect:
            - statusCode: [200, 500]  # 500 if model not loaded
          capture:
            - json: "$.image"
              as: "generatedImage"